zupcorp23012025.Расширение1/src/Documents/ПланыВыручкиПоАптекам/ПланыВыручкиПоАптекам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланыВыручкиПоАптекам</name>
  <registerRecords>InformationRegister.ПланыВыручкиПоАптекам</registerRecords>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланПоВыручкеВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланПоВыручкеОптики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КабинетВрача</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КТЗБезОптики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗМЗБезОптики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗМЗОптики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zupcorp23012025.Расширение1/src/InformationRegisters/ПланыВыручкиПоАптекам/ПланыВыручкиПоАптекам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланыВыручкиПоАптекам</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПланПоВыручкеВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланПоВыручкеОптики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КабинетВрача</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КТЗБезОптики</name>
    <comment>Скорость товарооборота</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗМЗБезОптики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗМЗОптики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zupcorp23012025.Расширение1/src/Documents/ПланыВыручкиПоАптекам/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПланыВыручкиПоАптекам
	Движения.ПланыВыручкиПоАптекам.Записывать = Истина;
	Для Каждого ТекСтрокаПоказатели Из Показатели Цикл
		Движение = Движения.ПланыВыручкиПоАптекам.Добавить();
		Движение.Период = Период;
		Движение.Подразделение = ТекСтрокаПоказатели.Подразделение;
		Движение.ПланПоВыручкеВсего = ТекСтрокаПоказатели.ПланПоВыручкеВсего;
		Движение.ПланПоВыручкеОптики = ТекСтрокаПоказатели.ПланПоВыручкеОптики;
		Движение.КабинетВрача = ТекСтрокаПоказатели.КабинетВрача;
		Движение.КТЗБезОптики = ТекСтрокаПоказатели.КТЗБезОптики;
		Движение.ЗМЗБезОптики = ТекСтрокаПоказатели.ЗМЗБезОптики;
		Движение.ЗМЗОптики = ТекСтрокаПоказатели.ЗМЗОптики;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
